Catalogs/СтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СтруктураПредприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_РедактированиеРазрешено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_КодЦФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_EmailРуководителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтруктураПредприятия/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обновление адресной книги
Перем ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге;
Перем ОбновитьДанныеОтображенияСтруктурыПредприятияВАдреснойКниге;
Перем ОбновитьСловаПоискаПоСтруктуреПредприятияВАдреснойКниге;
Перем ОбновитьДоступностьВПоискеПоСтруктуреПредприятия;

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	РеквизитыПодразделенияПоСсылке = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Ссылка, "Руководитель, Родитель, ПометкаУдаления, Наименование");
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("СтарыйРуководитель", РеквизитыПодразделенияПоСсылке.Руководитель);
	ДополнительныеСвойства.Вставить("СтарыйРодитель", РеквизитыПодразделенияПоСсылке.Родитель);
	ДополнительныеСвойства.Вставить("СтараяПометкаУдаления", РеквизитыПодразделенияПоСсылке.ПометкаУдаления);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Обновление адресной книги
	ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге = Ложь;
	ОбновитьДанныеОтображенияСтруктурыПредприятияВАдреснойКниге = Ложь;
	ОбновитьСловаПоискаПоСтруктуреПредприятияВАдреснойКниге = Ложь;
	ОбновитьДоступностьВПоискеПоСтруктуреПредприятия = Ложь;
	
	Если ЭтоНовый() Тогда
		ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге = Истина;
		ОбновитьСловаПоискаПоСтруктуреПредприятияВАдреснойКниге = Истина;
	Иначе
		Если РеквизитыПодразделенияПоСсылке.Родитель <> Родитель Тогда
			ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге = Истина;
		КонецЕсли;
		Если РеквизитыПодразделенияПоСсылке.ПометкаУдаления <> ПометкаУдаления Тогда
			ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге = Истина;
			ОбновитьДанныеОтображенияСтруктурыПредприятияВАдреснойКниге = Истина;
			ОбновитьДоступностьВПоискеПоСтруктуреПредприятия = Истина;
		КонецЕсли;
		Если РеквизитыПодразделенияПоСсылке.Наименование <> Наименование Тогда
			ОбновитьСловаПоискаПоСтруктуреПредприятияВАдреснойКниге = Истина;
			ОбновитьДанныеОтображенияСтруктурыПредприятияВАдреснойКниге = Истина;
			ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// ТСК Близнюк С.И.; 16.10.2018; task#1379{
	ра_ОбщегоНазначения.ПроверитьУникальностьРеквизита(ЭтотОбъект, "ра_КодЦФО");
	// ТСК Близнюк С.И.; 16.10.2018; task#1379}
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка
		И ЗначениеЗаполнено(ОбменДанными.Отправитель)
		И ОбменДаннымиПовтИсп.ЭтоУзелРаспределеннойИнформационнойБазы(ОбменДанными.Отправитель) Тогда
		Возврат;
	КонецЕсли;
	
	// Общий обработчик для всех разрезов доступа.
	ДокументооборотПраваДоступа.ПриЗаписиРазрезаДоступа(ЭтотОбъект, Отказ);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение разрешений по умолчанию.
	РегистрыСведений.РазрешенияДоступаОбщие.ЗаполнитьРазрешенияПоПодразделениям(ЭтотОбъект.Ссылка);
	
	Если Руководитель <> ДополнительныеСвойства.СтарыйРуководитель Тогда
		УправлениеДоступомВызовСервераДокументооборот.ЗаполнитьПодчиненностьПользователейПоПодразделению(Ссылка);
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		РегистрыСведений.ПодчиненностьПодразделений.СоздатьТривиальнуюЗапись(Ссылка);
	КонецЕсли;
	
	Если Родитель <> ДополнительныеСвойства.СтарыйРодитель Тогда
		УправлениеДоступомВызовСервераДокументооборот.ЗаполнитьСоставСотрудниковРодительскихПодразделений(ДополнительныеСвойства.СтарыйРодитель);
		УправлениеДоступомВызовСервераДокументооборот.ЗаполнитьСоставСотрудниковРодительскихПодразделений(Родитель);
		РегистрыСведений.ПодчиненностьПодразделений.ОбновитьДанныеВышестоящегоПодразделения(ДополнительныеСвойства.СтарыйРодитель);
		РегистрыСведений.ПодчиненностьПодразделений.ОбновитьДанныеВышестоящегоПодразделения(Родитель);
	КонецЕсли;
	
	ОбработанныеКонтейнеры = Новый Массив;
	Если ПометкаУдаления <> ДополнительныеСвойства.СтараяПометкаУдаления Тогда
		РегистрыСведений.ПользователиВКонтейнерах.ОбновитьДанныеКонтейнера(Ссылка, ОбработанныеКонтейнеры);
	КонецЕсли;
		
	Если Родитель <> ДополнительныеСвойства.СтарыйРодитель Тогда
		РегистрыСведений.ПользователиВКонтейнерах.ОбновитьДанныеКонтейнера(Родитель, ОбработанныеКонтейнеры);
		РегистрыСведений.ПользователиВКонтейнерах.ОбновитьДанныеКонтейнера(ДополнительныеСвойства.СтарыйРодитель, ОбработанныеКонтейнеры);
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	// Обновление адресной книги
	Если ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге Тогда
		Справочники.АдреснаяКнига.ОбновитьДанныеОбъекта(
			Ссылка, Родитель, Справочники.АдреснаяКнига.ПоСтруктуреПредприятия);
	КонецЕсли;
	Если ОбновитьДанныеОтображенияСтруктурыПредприятияВАдреснойКниге Тогда
		Справочники.АдреснаяКнига.ОбновитьДанныеОтображенияПодчиненногоОбъекта(Ссылка);
	КонецЕсли;
	Если ОбновитьСловаПоискаПоСтруктуреПредприятияВАдреснойКниге Тогда
		РегистрыСведений.ПоискВАдреснойКниге.ОбновитьСловаПоискаПоПодразделению(ЭтотОбъект);
	КонецЕсли;
	Если ОбновитьДоступностьВПоискеПоСтруктуреПредприятия Тогда
		РегистрыСведений.ПоискВАдреснойКниге.ОбновитьДоступностьВПоиске(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		ра_Организация = ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("ра_Организация", ра_Организация);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ра_Организация) Тогда
		
		Если Не ра_Организация.ра_ОрганизацияОтрасли Тогда
			Родитель = Справочники.СтруктураПредприятия.Прочие;
		КонецЕсли;
	
		Наименование       = ра_Организация.Наименование;
		НаименованиеПолное = ра_Организация.НаименованиеПолное;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// ТСК Корнюшенков А.Ю. ОбменЛучшимиПрактиками 01.11.2018 {
	// для руководителя должно быть заполнен либо руководитель, либо его e-mail
	Если Не (ЗначениеЗаполнено(Руководитель) 
		Или ЗначениеЗаполнено(ра_EmailРуководителя)) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Должен быть заполнен руководитель подразделения или его e-mail'; en = 'It is necessary to fill the manager or his e-mail'"), Ссылка, "Руководитель", "Объект", Отказ);
	ИначеЕсли ЗначениеЗаполнено(ра_EmailРуководителя)
		И Не РаботаСоСтроками.ЭтоАдресЭлектроннойПочты(ра_EmailРуководителя) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите правильный адрес электронной почты'; en = 'Please specify a valid email address'"), Ссылка, "ра_EmailРуководителя", "Объект", Отказ);
	КонецЕсли;	
	// ТСК Корнюшенков А.Ю. ОбменЛучшимиПрактиками 01.11.2018 } 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
